icssw-org/MeshCom-Firmware/src/esp32/esp32_flash.cpp
#include <Arduino.h>

#include "esp32_flash.h"
#if !defined(MC_SAFEBOOT)
// TM-32: der Sanitize-Pfad braucht Varianten-Konstanten (configuration.h via
// lora_setchip.h), die der minimale Safeboot-Build nicht hat -- und kein Radio,
// dessen Parameter zu plausibilisieren waeren.
#include <settings_sanitize.h>
#include <lora_setchip.h>
#else
#include <maxhop.h>   // MAXHOP_TEXT_FALLBACK, dependency-frei (siehe unten)
#endif

void save_settings(void);

#include <Preferences.h>

#include "printfdeb_functions.h"

Preferences preferences;

s_meshcom_settings meshcom_settings;

// Get LoRa parameter
// TM-32: Plausibilitaet der geladenen Radio-Parameter (Marker und Groesse
// prueft N-12, den Inhalt bisher niemand). Korrekturen werden geloggt.
#if !defined(MC_SAFEBOOT)
static void sanitize_log(const char *field, const char *oldv, const char *newv)
{
    Serial.printf("[FLASH]...sanitized %s: %s -> %s\n", field, oldv, newv);
}

void sanitize_loaded_settings(void)
{
    RadioLimits lim = { TX_POWER_MIN, TX_POWER_MAX, 400.0f, 960.0f, 0, 0, max_country };
    RadioParams p = { meshcom_settings.node_power, meshcom_settings.node_freq, meshcom_settings.node_bw,
                      meshcom_settings.node_sf, meshcom_settings.node_cr, meshcom_settings.node_country };
    int fixed = sanitize_radio_params(p, lim, sanitize_log);
    if(fixed > 0)
    {
        meshcom_settings.node_power = p.power;
        meshcom_settings.node_freq = p.freq;
        meshcom_settings.node_bw = p.bw;
        meshcom_settings.node_sf = p.sf;
        meshcom_settings.node_cr = p.cr;
        meshcom_settings.node_country = p.country;
    }

    // CS-01: derselbe Plausibilitaetspfad fuer das persistente Hop-Limit
    if(sanitize_max_hop_text(meshcom_settings.max_hop_text, sanitize_log))
        fixed++;

    // Akku-Maximalspannung muss ueber der Board-Leerspannung liegen (2S TBEAM_1W: nach
    // Wipe 4.2 V < 6.5 V -> BAT-01 meldet "kein Akku", Anzeige bleibt auf USB)
    #if defined(BAT_MIN_VOLTAGE) && defined(BAT_MAX_VOLTAGE)
    if(sanitize_max_voltage(meshcom_settings.node_maxv, BAT_MIN_VOLTAGE, BAT_MAX_VOLTAGE, sanitize_log))
        fixed++;
    #endif

    if(fixed > 0)
    {
        Serial.printf("[FLASH]...%d setting(s) out of range, reset to default\n", fixed);
        save_settings();    // einmal zurueckschreiben, sonst meldet jeder Boot dieselbe Korrektur
    }
}
#endif // !MC_SAFEBOOT

void init_flash(void)
{
    Serial.println("[INIT]...init_flash");
    
    preferences.begin("Credentials", false);

    String strVar = preferences.getString("node_call");
    snprintf(meshcom_settings.node_call, sizeof(meshcom_settings.node_call), "%s", strVar.c_str());

    strVar = preferences.getString("node_short");
    snprintf(meshcom_settings.node_short, sizeof(meshcom_settings.node_short), "%s", strVar.c_str());

    meshcom_settings.node_symid = preferences.getChar("node_symid", '/');
    meshcom_settings.node_symcd = preferences.getChar("node_symcd", '#');

    meshcom_settings.node_lat = preferences.getDouble("node_lat", 0.0);
    meshcom_settings.node_lon = preferences.getDouble("node_lon", 0.0);
    meshcom_settings.node_alt = preferences.getInt("node_alt", 0);
    meshcom_settings.node_lat_c = preferences.getChar("node_lat_c", 'N');
    meshcom_settings.node_lon_c = preferences.getChar("node_lon_c", 'E');

    meshcom_settings.node_temp = preferences.getFloat("node_temp", 0.0);
    meshcom_settings.node_hum = preferences.getFloat("node_hum", 0.0);
    meshcom_settings.node_press = preferences.getFloat("node_press", 0.0);

    strVar = preferences.getString("node_ssid", "none");
    snprintf(meshcom_settings.node_ossid, sizeof(meshcom_settings.node_ossid), "%s", strVar.c_str());
    strVar = preferences.getString("node_pwd", "none");
    snprintf(meshcom_settings.node_opwd, sizeof(meshcom_settings.node_opwd), "%s", strVar.c_str());

    meshcom_settings.node_hamnet_only = preferences.getInt("node_honly", 0);

    meshcom_settings.node_sset = preferences.getInt("node_sset", 0x0004);

    meshcom_settings.node_maxv = preferences.getFloat("node_maxv", 4.200);

    strVar = preferences.getString("node_extern", "none");
    snprintf(meshcom_settings.node_extern, sizeof(meshcom_settings.node_extern), "%s", strVar.c_str());

    meshcom_settings.node_msgid = preferences.getInt("node_msgid", 0);
    meshcom_settings.node_ackid = preferences.getInt("node_ackid", 0);

    meshcom_settings.node_power = preferences.getInt("node_power",-20); // not set
    meshcom_settings.node_freq = preferences.getFloat("node_freq", 0);
    meshcom_settings.node_bw = preferences.getFloat("node_bw", 0);
    meshcom_settings.node_sf = preferences.getInt("node_sf", 0);
    meshcom_settings.node_cr = preferences.getInt("node_cr", 0);

    strVar = preferences.getString("node_atxt");
    snprintf(meshcom_settings.node_atxt, sizeof(meshcom_settings.node_atxt), "%s", strVar.c_str());

    meshcom_settings.node_sset2 = preferences.getInt("node_sset2", 0x0000);
    meshcom_settings.node_disp_rot = preferences.getInt("node_disrot", 0);   // Display-Dreh-Offset (--rotate); Default 0 = Werksausrichtung
    meshcom_settings.node_owgpio = preferences.getInt("node_owgpio", 0);

    meshcom_settings.node_temp2 = preferences.getFloat("node_temp2", 0.0);

    meshcom_settings.node_utcoff = preferences.getFloat("node_utcof", 1.0); // UTC Zone Europe

    // BME680
    meshcom_settings.node_gas_res = preferences.getFloat("node_gas", 0.0);

    // CMCU-811
    meshcom_settings.node_co2 = preferences.getFloat("node_co2", 0.0);

	// MCP23017
    meshcom_settings.node_mcp17io = preferences.getInt("node_mcp17", 0);
    meshcom_settings.node_mcp17out = preferences.getInt("node_mcp17o", 0);
    meshcom_settings.node_mcp17in = preferences.getInt("node_mcp17i", 0);

    strVar = preferences.getString("node_mcp170");
    snprintf(meshcom_settings.node_mcp17t[0], sizeof(meshcom_settings.node_mcp17t[0]), "%s", strVar.c_str());
    strVar = preferences.getString("node_mcp171");
    snprintf(meshcom_settings.node_mcp17t[1], sizeof(meshcom_settings.node_mcp17t[1]), "%s", strVar.c_str());
    strVar = preferences.getString("node_mcp172");
    snprintf(meshcom_settings.node_mcp17t[2], sizeof(meshcom_settings.node_mcp17t[2]), "%s", strVar.c_str());
    strVar = preferences.getString("node_mcp173");
    snprintf(meshcom_settings.node_mcp17t[3], sizeof(meshcom_settings.node_mcp17t[3]), "%s", strVar.c_str());
    strVar = preferences.getString("node_mcp174");
    snprintf(meshcom_settings.node_mcp17t[4], sizeof(meshcom_settings.node_mcp17t[4]), "%s", strVar.c_str());
    strVar = preferences.getString("node_mcp175");
    snprintf(meshcom_settings.node_mcp17t[5], sizeof(meshcom_settings.node_mcp17t[5]), "%s", strVar.c_str());
    strVar = preferences.getString("node_mcp176");
    snprintf(meshcom_settings.node_mcp17t[6], sizeof(meshcom_settings.node_mcp17t[6]), "%s", strVar.c_str());
    strVar = preferences.getString("node_mcp177");
    snprintf(meshcom_settings.node_mcp17t[7], sizeof(meshcom_settings.node_mcp17t[7]), "%s", strVar.c_str());

    strVar = preferences.getString("node_mcp178");
    snprintf(meshcom_settings.node_mcp17t[8], sizeof(meshcom_settings.node_mcp17t[8]), "%s", strVar.c_str());
    strVar = preferences.getString("node_mcp179");
    snprintf(meshcom_settings.node_mcp17t[9], sizeof(meshcom_settings.node_mcp17t[9]),"%s", strVar.c_str());
    strVar = preferences.getString("node_mcp1710");
    snprintf(meshcom_settings.node_mcp17t[10], sizeof(meshcom_settings.node_mcp17t[10]),"%s", strVar.c_str());
    strVar = preferences.getString("node_mcp1711");
    snprintf(meshcom_settings.node_mcp17t[11], sizeof(meshcom_settings.node_mcp17t[11]),"%s", strVar.c_str());
    strVar = preferences.getString("node_mcp1712");
    snprintf(meshcom_settings.node_mcp17t[12], sizeof(meshcom_settings.node_mcp17t[12]),"%s", strVar.c_str());
    strVar = preferences.getString("node_mcp1713");
    snprintf(meshcom_settings.node_mcp17t[13], sizeof(meshcom_settings.node_mcp17t[13]),"%s", strVar.c_str());
    strVar = preferences.getString("node_mcp1714");
    snprintf(meshcom_settings.node_mcp17t[14], sizeof(meshcom_settings.node_mcp17t[14]),"%s", strVar.c_str());
    strVar = preferences.getString("node_mcp1715");
    snprintf(meshcom_settings.node_mcp17t[15], sizeof(meshcom_settings.node_mcp17t[15]),"%s", strVar.c_str());

