icssw-org/MeshCom-Firmware/src/esp32/esp32_flash.cpp
	// GM Fields
    meshcom_settings.node_gcb[0] = preferences.getInt("node_gcb0", 0);
    meshcom_settings.node_gcb[1] = preferences.getInt("node_gcb1", 0);
    meshcom_settings.node_gcb[2] = preferences.getInt("node_gcb2", 0);
    meshcom_settings.node_gcb[3] = preferences.getInt("node_gcb3", 0);
    meshcom_settings.node_gcb[4] = preferences.getInt("node_gcb4", 0);
    meshcom_settings.node_gcb[5] = preferences.getInt("node_gcb5", 0);

    meshcom_settings.node_country = preferences.getInt("node_ctry");    // 0...EU  1...UK, 2...IT, 3...US, ..... 18...868, 19...915

    // CS-01: Hop-Limit fuer Textnachrichten. Bis 2026-08-30 gab es keinen
    // NVS-Key dafuer -- der Wert war faktisch eine Compile-Zeit-Konstante.
    // max_hop_pos bleibt bewusst beim Default (esp32_main.cpp). Im Safeboot
    // kommt MAX_HOP_TEXT_DEFAULT (configuration_global.h) nicht mit --
    // dort tut es der Spiegelwert aus maxhop.h.
    #if defined(MC_SAFEBOOT)
    meshcom_settings.max_hop_text = preferences.getInt("max_hop_text", MAXHOP_TEXT_FALLBACK);
    #else
    meshcom_settings.max_hop_text = preferences.getInt("max_hop_text", MAX_HOP_TEXT_DEFAULT);
    #endif

    // TM-32 (upstream #661/#57): Radio-Parameter auf Plausibilitaet pruefen,
    // bevor sie in radio.setOutputPower() & Co. landen. Sentinels bleiben.
    #if !defined(MC_SAFEBOOT)
    sanitize_loaded_settings();
    #endif

    meshcom_settings.node_track_freq = preferences.getFloat("node_track", 0);
    meshcom_settings.node_preamplebits = preferences.getInt("node_pream", 32);

    meshcom_settings.node_ss_rx_pin = preferences.getInt("node_ss_rx", 0);
    meshcom_settings.node_ss_tx_pin = preferences.getInt("node_ss_tx", 0);
    meshcom_settings.node_ss_baud = preferences.getInt("node_ss_bd", 0);

    meshcom_settings.node_postime = preferences.getInt("node_postime", 0);

    strVar = preferences.getString("node_passwd");
    snprintf(meshcom_settings.node_passwd, sizeof(meshcom_settings.node_passwd), "%s", strVar.c_str());

    meshcom_settings.node_sset3 = preferences.getInt("node_sset3", 0x0000);

    meshcom_settings.bt_code = preferences.getInt("bt_code", 0x000000);

    meshcom_settings.node_button_pin = preferences.getInt("node_bpin", 0);

    strVar = preferences.getString("node_ownip");
    snprintf(meshcom_settings.node_ownip, sizeof(meshcom_settings.node_ownip), "%s", strVar.c_str());
    strVar = preferences.getString("node_owngw");
    snprintf(meshcom_settings.node_owngw, sizeof(meshcom_settings.node_owngw), "%s", strVar.c_str());
    strVar = preferences.getString("node_ownms");
    snprintf(meshcom_settings.node_ownms, sizeof(meshcom_settings.node_ownms), "%s", strVar.c_str());

    strVar = preferences.getString("node_name");
    snprintf(meshcom_settings.node_name, sizeof(meshcom_settings.node_name), "%s", strVar.c_str());

    strVar = preferences.getString("node_webpwd");
    snprintf(meshcom_settings.node_webpwd, sizeof(meshcom_settings.node_webpwd), "%s", strVar.c_str());

    strVar = preferences.getString("node_lssid", "none");
    snprintf(meshcom_settings.node_ssid, sizeof(meshcom_settings.node_ssid), "%s", strVar.c_str());
    strVar = preferences.getString("node_lpwd", "none");
    snprintf(meshcom_settings.node_pwd, sizeof(meshcom_settings.node_pwd), "%s", strVar.c_str());

    meshcom_settings.node_analog_pin = preferences.getInt("node_apin", 99);
    meshcom_settings.node_analog_faktor = preferences.getFloat("node_afakt", 1.0);

    strVar = preferences.getString("node_parm", "none");
    snprintf(meshcom_settings.node_parm, sizeof(meshcom_settings.node_parm), "%s", strVar.c_str());

    strVar = preferences.getString("node_unit", "none");
    snprintf(meshcom_settings.node_unit, sizeof(meshcom_settings.node_unit), "%s", strVar.c_str());

    strVar = preferences.getString("node_format", "none");
    snprintf(meshcom_settings.node_format, sizeof(meshcom_settings.node_format), "%s", strVar.c_str());

    strVar = preferences.getString("node_eqns", "none");
    snprintf(meshcom_settings.node_eqns, sizeof(meshcom_settings.node_eqns), "%s", strVar.c_str());

    strVar = preferences.getString("node_values", "none");
    snprintf(meshcom_settings.node_values, sizeof(meshcom_settings.node_values), "%s", strVar.c_str());
 
    meshcom_settings.node_parm_time = preferences.getInt("node_ptime", 15);

    meshcom_settings.node_specstart = preferences.getFloat("node_spstart", 432.0);
    meshcom_settings.node_specend = preferences.getFloat("node_spend", 434.0);
    meshcom_settings.node_specstep = preferences.getFloat("node_spstep", 0.025);
    meshcom_settings.node_specsamples = preferences.getInt("node_spsamp", 2048);

    meshcom_settings.node_analog_batt_faktor = preferences.getFloat("node_bfakt", 0.0);

    #if defined(BOARD_T_DECK) || defined(BOARD_T_DECK_PLUS) || defined(BOARD_T_DECK_PRO)
    meshcom_settings.node_map = preferences.getInt("node_map", 0);
    meshcom_settings.node_audio_start = preferences.getString("node_audstart", "/");
    meshcom_settings.node_audio_msg = preferences.getString("node_audmsg", "/");
    meshcom_settings.node_keyboardlock = preferences.getBool("node_kblock", false);
    meshcom_settings.node_backlightlock = preferences.getBool("node_bllock", false);
    meshcom_settings.node_kbllightlock = preferences.getBool("node_kllock", false);
    meshcom_settings.node_modus = preferences.getInt("node_modus", 0);
    meshcom_settings.node_mute = preferences.getBool("node_mute", false);
    meshcom_settings.node_persist_to_flash = preferences.getBool("node_perflash", false);
    meshcom_settings.node_persist_to_sd = preferences.getBool("node_persd", false);
    meshcom_settings.node_immediate_save = preferences.getBool("node_immsave", false);
    meshcom_settings.node_kbl_sync = preferences.getBool("node_kblsync", false);
    meshcom_settings.node_wifion = preferences.getBool("node_wifion", true);   // HL-02: struct default is true
    #endif

    meshcom_settings.node_wifi_power = preferences.getInt("node_wifip", 60);

    strVar = preferences.getString("node_ucall", "none");
    snprintf(meshcom_settings.node_lora_call, sizeof(meshcom_settings.node_lora_call), "%s", strVar.c_str());

    meshcom_settings.node_analog_alpha = preferences.getFloat("node_aak", 0.0);
    meshcom_settings.node_analog_slope = preferences.getFloat("node_aslo", 1.0);
    meshcom_settings.node_analog_offset = preferences.getFloat("node_aoff", 0.0);
    meshcom_settings.node_analog_atten = preferences.getFloat("node_atten", 0.0);
    
