icssw-org/MeshCom-Firmware/src/esp32/esp32_flash.cpp
    strVar = preferences.getString("node_gwsrv", "OE");
    snprintf(meshcom_settings.node_gwsrv, sizeof(meshcom_settings.node_gwsrv), "%s", strVar.c_str());

    meshcom_settings.node_tempi_off = preferences.getFloat("node_tmpiof", 0.0);
    meshcom_settings.node_tempo_off = preferences.getFloat("node_tmpoof", 0.0);

    meshcom_settings.node_shunt = preferences.getFloat("node_shunt", 0.002);
    meshcom_settings.node_imax = preferences.getFloat("node_imax", 20.0);
    meshcom_settings.node_isamp = preferences.getInt("node_isamp", 7);
    meshcom_settings.node_isamp = preferences.getInt("node_isamp", 7);

    strVar = preferences.getString("node_owndns");
    snprintf(meshcom_settings.node_owndns, sizeof(meshcom_settings.node_owndns), "%s", strVar.c_str());

    meshcom_settings.node_contrast = preferences.getInt("node_contrast", 255);

    meshcom_settings.node_fversion = preferences.getInt("node_fversion", 0);

    strVar = preferences.getString("node_ownntp");
    snprintf(meshcom_settings.node_ownntp, sizeof(meshcom_settings.node_ownntp), "%s", strVar.c_str());

    meshcom_settings.node_mversion = preferences.getInt("node_mversion", 0);

    strVar = preferences.getString("node_fwversion");
    snprintf(meshcom_settings.node_fwversion, sizeof(meshcom_settings.node_fwversion), "%s", strVar.c_str());

    meshcom_settings.node_gpsbaud = preferences.getUInt("node_gpsbaud", 38400);

    meshcom_settings.node_cleanflash = preferences.getUInt("node_cflash", 0);

    // Network Mode wifi/eth
    meshcom_settings.node_netmode = preferences.getInt("node_netmode", 0);

    // GPSDEBUG 0 ... none, 1...only valid, 2...all info
    meshcom_settings.node_gpsdebug = preferences.getInt("node_gpsdebug", 0);

    meshcom_settings.node_relay = preferences.getInt("node_relay", 0);

    strVar = preferences.getString("node_via");
    snprintf(meshcom_settings.node_via, sizeof(meshcom_settings.node_via), "%s", strVar.c_str());

    meshcom_settings.node_sset4 = preferences.getInt("node_sset4", 0x0002); // defaut 0x0002: DEBUGEN = true

    strVar = preferences.getString("node_aprsmc");
    snprintf(meshcom_settings.node_aprsmc, sizeof(meshcom_settings.node_aprsmc), "%s", strVar.c_str());

    meshcom_settings.node_pingtime = preferences.getInt("node_pingtime", 0);

    strVar = preferences.getString("node_pingcall");
    snprintf(meshcom_settings.node_pingcall, sizeof(meshcom_settings.node_pingcall), "%s", strVar.c_str());

    meshcom_settings.node_pingmax = preferences.getInt("node_pingmax", 0);

    preferences.end();
}

void clear_flash(void)
{
    preferences.begin("Credentials", false);

    printfdeb("[INIT]...FLASH #entries %i bevor clear\n", (int)preferences.freeEntries());

    preferences.freeEntries();
    
    preferences.clear();

    printfdeb("[INIT]...FLASH #entries %i after clear\n", preferences.freeEntries());
    preferences.end();
}

void save_settings(void)
{
    preferences.begin("Credentials", false);

    String strVar;
    
    strVar = meshcom_settings.node_call;
    preferences.putString("node_call", strVar); 

    strVar = meshcom_settings.node_short;
    preferences.putString("node_short", strVar); 

    preferences.putChar("node_symid", meshcom_settings.node_symid);
    preferences.putChar("node_symcd", meshcom_settings.node_symcd);

    preferences.putDouble("node_lat", meshcom_settings.node_lat);
    preferences.putDouble("node_lon", meshcom_settings.node_lon);
    preferences.putInt("node_alt", meshcom_settings.node_alt);

    preferences.putChar("node_lat_c", meshcom_settings.node_lat_c);
    preferences.putChar("node_lon_c", meshcom_settings.node_lon_c);

    preferences.putFloat("node_temp", meshcom_settings.node_temp);
    preferences.putFloat("node_hum", meshcom_settings.node_hum);
    preferences.putFloat("node_press", meshcom_settings.node_press);

    strVar = meshcom_settings.node_ossid;
    preferences.putString("node_ssid", strVar); 
    strVar = meshcom_settings.node_opwd;
    preferences.putString("node_pwd", strVar); 

    preferences.putInt("node_honly", meshcom_settings.node_hamnet_only);

    preferences.putInt("node_sset", meshcom_settings.node_sset);

    preferences.putFloat("node_maxv", meshcom_settings.node_maxv);

    strVar = meshcom_settings.node_extern;
    preferences.putString("node_extern", strVar); 

    preferences.putInt("node_msgid", meshcom_settings.node_msgid);
    preferences.putInt("node_ackid", meshcom_settings.node_ackid);

    // CS-01: Hop-Limit fuer Textnachrichten (--maxhop). max_hop_pos wird bewusst
    // nicht gespeichert und bleibt beim Compile-Default.
    preferences.putInt("max_hop_text", meshcom_settings.max_hop_text);

    preferences.putInt("node_power", meshcom_settings.node_power);
    preferences.putFloat("node_freq", meshcom_settings.node_freq);
    preferences.putFloat("node_bw", meshcom_settings.node_bw);
    preferences.putInt("node_sf", meshcom_settings.node_sf);
    preferences.putInt("node_cr", meshcom_settings.node_cr);

    strVar = meshcom_settings.node_atxt;
    preferences.putString("node_atxt", strVar); 

    preferences.putInt("node_sset2", meshcom_settings.node_sset2);
    preferences.putInt("node_disrot", meshcom_settings.node_disp_rot);   // Display-Dreh-Offset (--rotate)
    preferences.putInt("node_owgpio", meshcom_settings.node_owgpio);

    preferences.putFloat("node_temp2", meshcom_settings.node_temp2);

    preferences.putFloat("node_utcof", meshcom_settings.node_utcoff);

    // BME680
    preferences.putFloat("node_gas", meshcom_settings.node_gas_res);

    // CMCU-811
    preferences.putFloat("node_co2", meshcom_settings.node_co2);

    // MCP23017
    preferences.putInt("node_mcp17", meshcom_settings.node_mcp17io);
    preferences.putInt("node_mcp17o", meshcom_settings.node_mcp17out);
    preferences.putInt("node_mcp17i", meshcom_settings.node_mcp17in);
    
    strVar = meshcom_settings.node_mcp17t[0];
    preferences.putString("node_mcp170", strVar); 
    strVar = meshcom_settings.node_mcp17t[1];
    preferences.putString("node_mcp171", strVar); 
    strVar = meshcom_settings.node_mcp17t[2];
    preferences.putString("node_mcp172", strVar); 
    strVar = meshcom_settings.node_mcp17t[3];
    preferences.putString("node_mcp173", strVar); 
    strVar = meshcom_settings.node_mcp17t[4];
    preferences.putString("node_mcp174", strVar); 
    strVar = meshcom_settings.node_mcp17t[5];
    preferences.putString("node_mcp175", strVar); 
    strVar = meshcom_settings.node_mcp17t[6];
    preferences.putString("node_mcp176", strVar); 
    strVar = meshcom_settings.node_mcp17t[7];
    preferences.putString("node_mcp177", strVar); 

