icssw-org/MeshCom-Firmware/src/esp32/esp32_flash.cpp
    strVar = meshcom_settings.node_mcp17t[8];
    preferences.putString("node_mcp178", strVar); 
    strVar = meshcom_settings.node_mcp17t[9];
    preferences.putString("node_mcp179", strVar); 
    strVar = meshcom_settings.node_mcp17t[10];
    preferences.putString("node_mcp1710", strVar); 
    strVar = meshcom_settings.node_mcp17t[11];
    preferences.putString("node_mcp1711", strVar); 
    strVar = meshcom_settings.node_mcp17t[12];
    preferences.putString("node_mcp1712", strVar); 
    strVar = meshcom_settings.node_mcp17t[13];
    preferences.putString("node_mcp1713", strVar); 
    strVar = meshcom_settings.node_mcp17t[14];
    preferences.putString("node_mcp1714", strVar); 
    strVar = meshcom_settings.node_mcp17t[15];
    preferences.putString("node_mcp1715", strVar); 

	// GM Fields
    preferences.putInt("node_gcb0", meshcom_settings.node_gcb[0]);
    preferences.putInt("node_gcb1", meshcom_settings.node_gcb[1]);
    preferences.putInt("node_gcb2", meshcom_settings.node_gcb[2]);
    preferences.putInt("node_gcb3", meshcom_settings.node_gcb[3]);
    preferences.putInt("node_gcb4", meshcom_settings.node_gcb[4]);
    preferences.putInt("node_gcb5", meshcom_settings.node_gcb[5]);

    preferences.putInt("node_ctry", meshcom_settings.node_country);    // 0...EU  1...UK, 2...IT, 3...US, ..... 18...868, 19...915

    preferences.putFloat("node_track", meshcom_settings.node_track_freq);
    preferences.putInt("node_pream", meshcom_settings.node_preamplebits);

    preferences.putInt("node_ss_rx", meshcom_settings.node_ss_rx_pin);
    preferences.putInt("node_ss_tx", meshcom_settings.node_ss_tx_pin);
    preferences.putInt("node_ss_bd", meshcom_settings.node_ss_baud);

    preferences.putInt("node_postime", meshcom_settings.node_postime);

    strVar = meshcom_settings.node_passwd;
    preferences.putString("node_passwd", strVar); 

    preferences.putInt("node_sset3", meshcom_settings.node_sset3);

    preferences.putInt("bt_code", meshcom_settings.bt_code);

    preferences.putInt("node_bpin", meshcom_settings.node_button_pin);

    strVar = meshcom_settings.node_ownip;
    preferences.putString("node_ownip", strVar); 
    strVar = meshcom_settings.node_owngw;
    preferences.putString("node_owngw", strVar); 
    strVar = meshcom_settings.node_ownms;
    preferences.putString("node_ownms", strVar); 

    strVar = meshcom_settings.node_name;
    preferences.putString("node_name", strVar); 

    strVar = meshcom_settings.node_webpwd;
    preferences.putString("node_webpwd", strVar); 

    strVar = meshcom_settings.node_ssid;
    preferences.putString("node_lssid", strVar); 
    strVar = meshcom_settings.node_pwd;
    preferences.putString("node_lpwd", strVar); 

    preferences.putInt("node_apin", meshcom_settings.node_analog_pin);
    preferences.putFloat("node_afakt", meshcom_settings.node_analog_faktor);

    strVar = meshcom_settings.node_parm;
    preferences.putString("node_parm", strVar); 

    strVar = meshcom_settings.node_unit;
    preferences.putString("node_unit", strVar);

    strVar = meshcom_settings.node_format;
    preferences.putString("node_format", strVar);

    strVar = meshcom_settings.node_eqns;
    preferences.putString("node_eqns", strVar);

    strVar = meshcom_settings.node_values;
    preferences.putString("node_values", strVar);

    preferences.putInt("node_ptime", meshcom_settings.node_parm_time);

    preferences.putFloat("node_spstart", meshcom_settings.node_specstart);
    preferences.putFloat("node_spend", meshcom_settings.node_specend);
    preferences.putFloat("node_spstep", meshcom_settings.node_specstep);
    preferences.putInt("node_spsamp", meshcom_settings.node_specsamples);

    preferences.putFloat("node_bfakt", meshcom_settings.node_analog_batt_faktor);
    
    #if defined(BOARD_T_DECK) || defined(BOARD_T_DECK_PLUS)  || defined(BOARD_T_DECK_PRO)
    preferences.putInt("node_map", meshcom_settings.node_map);
    preferences.putString("node_audstart", meshcom_settings.node_audio_start);
    preferences.putString("node_audmsg", meshcom_settings.node_audio_msg);
    preferences.putBool("node_kblock", meshcom_settings.node_keyboardlock);
    preferences.putBool("node_bllock", meshcom_settings.node_backlightlock);
    preferences.putBool("node_kllock", meshcom_settings.node_kbllightlock);
    preferences.putInt("node_modus", meshcom_settings.node_modus);
    preferences.putBool("node_mute", meshcom_settings.node_mute);
    preferences.putBool("node_perflash", meshcom_settings.node_persist_to_flash);
    preferences.putBool("node_persd", meshcom_settings.node_persist_to_sd);
    preferences.putBool("node_immsave", meshcom_settings.node_immediate_save);
    preferences.putBool("node_kblsync", meshcom_settings.node_kbl_sync);
    preferences.putBool("node_wifion", meshcom_settings.node_wifion);
    #endif 

    preferences.putInt("node_wifip", meshcom_settings.node_wifi_power);

    strVar = meshcom_settings.node_lora_call;
    preferences.putString("node_ucall", strVar);
    
    preferences.putFloat("node_aak", meshcom_settings.node_analog_alpha);
    preferences.putFloat("node_aslo", meshcom_settings.node_analog_slope);
    preferences.putFloat("node_aoff", meshcom_settings.node_analog_offset);
    preferences.putFloat("node_atten", meshcom_settings.node_analog_atten);

    strVar = meshcom_settings.node_gwsrv;
    preferences.putString("node_gwsrv", strVar);

    preferences.putFloat("node_tmpiof", meshcom_settings.node_tempi_off);
    preferences.putFloat("node_tmpoof", meshcom_settings.node_tempo_off);

    preferences.putFloat("node_shunt", meshcom_settings.node_shunt);
    preferences.putFloat("node_imax", meshcom_settings.node_imax);
    preferences.putInt("node_isamp", meshcom_settings.node_isamp);

    strVar = meshcom_settings.node_owndns;
    preferences.putString("node_owndns", strVar); 

    preferences.putInt("node_contrast", meshcom_settings.node_contrast);

    preferences.putInt("node_fversion", meshcom_settings.node_fversion);

    strVar = meshcom_settings.node_ownntp;
    preferences.putString("node_ownntp", strVar); 

    preferences.putInt("node_mversion", meshcom_settings.node_mversion);

    strVar = meshcom_settings.node_fwversion;
    preferences.putString("node_fwversion", strVar); 

    preferences.putULong("node_gpsbaud", meshcom_settings.node_gpsbaud);

    preferences.putULong("node_cflash", meshcom_settings.node_cleanflash);

    // Network Mode wifi/eth
    preferences.putInt("node_netmode", meshcom_settings.node_netmode);

    // GPSDEBUG 0 ... none, 1...only valid, 2...all info
    preferences.putInt("node_gpsdebug", meshcom_settings.node_gpsdebug);

    preferences.putInt("node_relay", meshcom_settings.node_relay);

    strVar = meshcom_settings.node_via;
    preferences.putString("node_via", strVar); 

    preferences.putInt("node_sset4", meshcom_settings.node_sset4);

    strVar = meshcom_settings.node_aprsmc;
    preferences.putString("node_aprsmc", strVar); 

    preferences.putInt("node_pingtime", meshcom_settings.node_pingtime);

    strVar = meshcom_settings.node_pingcall;
    preferences.putString("node_pingcall", strVar); 

    preferences.putInt("node_pingmax", meshcom_settings.node_pingmax);

    //printfdeb("[INIT]...FLASH #entries %i after write\n", (int)preferences.freeEntries());
    preferences.end();

    //Test only Serial.println("flash save...");
}
